tests/results-baseline.txt
Test run id: tyjd5_xfrrqjpwr4takcr7xhpjt3xbfq5rc_jxxc
Phase started: unnamed (index: 0, duration: 30s) 00:06:38(-0500)

--------------------------------------
Metrics for period to: 00:06:40(-0500) (width: 1.007s)
--------------------------------------

http.codes.200: ................................................................ 21
http.downloaded_bytes: ......................................................... 889
http.request_rate: ............................................................. 21/sec
http.requests: ................................................................. 21
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 18
  mean: ........................................................................ 5.3
  median: ...................................................................... 5
  p95: ......................................................................... 15
  p99: ......................................................................... 15
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 18
  mean: ........................................................................ 5.3
  median: ...................................................................... 5
  p95: ......................................................................... 15
  p99: ......................................................................... 15
http.responses: ................................................................ 21
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 11
vusers.created_by_name.0: ...................................................... 11
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12.6
  max: ......................................................................... 41.7
  mean: ........................................................................ 26.4
  median: ...................................................................... 25.8
  p95: ......................................................................... 36.2
  p99: ......................................................................... 36.2


--------------------------------------
Metrics for period to: 00:06:50(-0500) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 8100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 201
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 4.3
  median: ...................................................................... 3
  p95: ......................................................................... 10.1
  p99: ......................................................................... 34.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 4.3
  median: ...................................................................... 3
  p95: ......................................................................... 10.1
  p99: ......................................................................... 34.1
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.2
  max: ......................................................................... 96.6
  mean: ........................................................................ 13.7
  median: ...................................................................... 10.7
  p95: ......................................................................... 29.1
  p99: ......................................................................... 63.4


--------------------------------------
Metrics for period to: 00:07:00(-0500) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 8100
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 37
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 7.9
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 37
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 7.9
  p99: ......................................................................... 16
http.responses: ................................................................ 200
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.5
  max: ......................................................................... 43
  mean: ........................................................................ 11.3
  median: ...................................................................... 9.1
  p95: ......................................................................... 22
  p99: ......................................................................... 37.7


Phase completed: unnamed (index: 0, duration: 30s) 00:07:08(-0500)

--------------------------------------
Metrics for period to: 00:07:10(-0500) (width: 8.809s)
--------------------------------------

http.codes.200: ................................................................ 179
http.downloaded_bytes: ......................................................... 7211
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 178
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 19
  mean: ........................................................................ 3.5
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 19
  mean: ........................................................................ 3.5
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 12.1
http.responses: ................................................................ 179
vusers.completed: .............................................................. 90
vusers.created: ................................................................ 89
vusers.created_by_name.0: ...................................................... 89
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.2
  max: ......................................................................... 42.9
  mean: ........................................................................ 10.5
  median: ...................................................................... 8.8
  p95: ......................................................................... 18
  p99: ......................................................................... 24.3


All VUs finished. Total time: 32 seconds

--------------------------------
Summary report @ 00:07:11(-0500)
--------------------------------

http.codes.200: ................................................................ 600
http.downloaded_bytes: ......................................................... 24300
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 18
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 40
  mean: ........................................................................ 3.9
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 18
http.responses: ................................................................ 600
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5.2
  max: ......................................................................... 96.6
  mean: ........................................................................ 12.3
  median: ...................................................................... 9.5
  p95: ......................................................................... 25.8
  p99: ......................................................................... 43.4